---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ConnectorElement..::..ChangeHostReference Method
ConnectorElement Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | ChangeHostReference(Reference) | Changes the connector host reference to a new planar face. |
|  | ChangeHostReference(Reference, Edge) | Changes the connector host reference to a new planar face and a new edge loop. |

# See Also

ConnectorElement Class

ConnectorElement Members

Autodesk.Revit.DB Namespace